'''
Date: 2025-02-21 10:56:53
LastEditors: yhl yuhailong@thalys-tech.onaliyun.com
LastEditTime: 2025-03-06 14:07:17
FilePath: /bott/bot-dd/src/utils/jx3_profession.py
'''
from enum import Enum
from typing import Optional

class JX3PROFESSION(Enum):
    """剑网三心法枚举"""

    无方 = {"无方"}
    灵素 = {"灵素", "药奶", "奶药", "药宗奶妈"}
    太玄经 = {"太玄经", "衍天宗", "衍天", "太玄"}
    隐龙诀 = {"隐龙诀",  "隐龙",  "凌雪阁",  "凌雪"}
    凌海诀 = {"凌海诀", "凌海", "蓬莱", "伞爹"}
    北傲诀 = {"北傲诀", "北傲", "霸刀", "刀爹"}
    莫问 = {"莫问"}
    相知 = {"相知", "歌奶", "奶歌"}
    分山劲 = {"分山劲", "分山", "苍云"}
    铁骨衣 = {"铁骨衣", "铁骨", "铁王八"}
    笑尘诀 = {"笑尘诀", "笑尘", "丐帮"}
    焚影圣诀 = {"焚影圣诀", "焚影", "喵喵"}
    明尊琉璃体 = {"明尊琉璃体", "明尊", "喵T", "喵t"}
    惊羽诀 = {"惊羽诀", "惊羽", "鲸鱼"}
    天罗诡道 = {"天罗诡道", "田螺", "天罗"}
    毒经 = {"毒经", "DJ", "毒经皇帝", "dj", "Dj"}
    补天诀 = {"补天诀", "补天", "奶毒", "毒奶"}
    问水诀 = {"山居剑意", "问水诀", "藏剑", "黄鸡", "山居", "问水", "鸡哥"}
    傲血战意 = {"傲血战意", "傲血", "哈士奇"}
    铁牢律 = {"铁牢律", "铁牢", "策T", "策t"}
    太虚剑意 = {"太虚剑意", "太虚", "剑纯", "备胎"}
    紫霞功 = {"紫霞功", "紫霞", "气纯", "渣男"}
    易筋经 = {"易筋经", "易筋", "光头"}
    洗髓经 = {"洗髓经", "洗髓", "和尚T", "和尚t", "大师t", "大师T"}
    冰心诀 = {"冰心诀", "冰心"}
    云裳心经 = {"云裳心经", "云裳", "秀奶", "奶秀"}
    花间游 = {"花间游", "花间"}
    离经易道 = {"离经易道", "离经", "奶花", "花奶",}
    孤锋诀 = {"孤锋诀", "刀宗","孤锋"}
    周天功 = {"周天功", "周天"}
    山海心诀 = {"山海心诀", "山海", "万灵"}

    @classmethod
    def get_profession(cls, name: str) -> Optional[str]:
        """通过别名获取职业名称"""
        for profession in cls:
            if name in profession.value:
                return profession.name
        return None